const alphabet = "АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
const alphabetSpace = "АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ "

const alphabetYO = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";

const alphabetExtra = "АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ -—.,?!«»:;"


const alphabetMatrix = [
    ["А", "Б", "В", "Г", "Д", "Е"],
    ["Ж", "З", "И", "Й", "К", "Л"],
    ["М", "Н", "О", "П", "Р", "С"],
    ["Т", "У", "Ф", "Х", "Ц", "Ч"],
    ["Ш", "Щ", "Ъ", "Ы", "Ь", "Э"],
    ["Ю", "Я", " ", ".", ",", "?"],
    ["!", "!?", "...", "-", "—", ";"],
    ["«", "»", ":"]
];